function encodeLine(str) {
	// Используем метод replace() для замены подстрок входной строки на соответствующие закодированные версии.
	// В первом аргументе метода передаем регулярное выражение, которое ищет повторяющиеся символы в строке.
	// Во втором аргументе передаем функцию обратного вызова, которая будет генерировать закодированные версии для найденных подстрок.
	return str.replace(/(.)\1*/g, (match, p1) => match.length > 1 ? match.length + p1 : p1);
 }

module.exports = {
  encodeLine
};
