function renameFiles(names) {
	// объект для хранения количества повторений имен файлов
	const count = {};
	// массив для хранения переименованных имен файлов
	const result = [];

	// обходим все имена файлов в порядке их следования в массиве
	for (const name of names) {
		// если имя файла встречается впервые
		if (!count[name]) {
			// сохраняем его в объекте с количеством повторений 1
			count[name] = 1;
			// и добавляем в результирующий массив
			result.push(name);
		// если имя файла уже было использовано
		} else {
			// создаем новое имя файла с добавлением суффикса "(k)"
			const newName = `${name}(${count[name]})`;
			// увеличиваем количество повторений имени файла
			count[name]++;
			// сохраняем новое имя файла в объекте с количеством повторений 1
			count[newName] = 1;
			// добавляем новое имя файла в результирующий массив
			result.push(newName);
		}
	}
	// возвращаем массив переименованных имен файлов
	return result;
}
 
module.exports = {
  renameFiles
};
