function sortByHeight(arr) {
	// Создаем отфильтрованный массив из оригинального где не будет значений -1
	let sortedArr = arr.filter((num) => num !== -1)
	// Сортируем отфильтрованный массив по возрастанию
	.sort((a, b) => a - b);
	// Возвращаем отсортированный исходный массив С помощью метода мар и условием: если элемент равен -1 оставляем его, если нет 
	// добавляем удаленный элемент из начала отсортированного массива методом shift
	return arr.map((num) => (num === -1 ? -1 : sortedArr.shift()));
}

module.exports = {
  sortByHeight
};
